package chap_06;

public class Study614 {
    /*
        Q. 다음 중 초기화에 대한 설명으로 옳지 않은 것은?
        1. 멤버변수는 자동 초기화되므로 초기화하지 않고도 값을 참조할 수 있다.
        2. 지역변수는 사용하기 전에 반드시 초기화해야 한다.
        3. 초기화 블럭보다 생성자가 먼저 수행된다.
        4. 명시적 초기화를 제일 우선적으로 고려해야 한다.
        5. 클래스변수보다 인스턴스 변수가 먼저 초기화 된다.

        1. O
        2. O
        3. X 초기화 블럭이 실행되고 나서 생성자
        4. X 자동 초기화가 제일 우선이지 않나?
        정답 O
        -> 멤버변수는 자동 초기화가 되므로 우선적으로 초기화를 고려할 필요가 없다.
        -> 지역변수는 수동초기화를 해줘야 하므로 사용하기 전에 우선적으로 초기화를 고려해야 한다.
        5. X 클래스 변수가 먼저 초기화 된다
     */
}
